<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>MC DAVO</title>
<link href="../CSS/biografia.css" rel="stylesheet" type="text/css" />
<style type="text/css">
<!--
.Estilo1 {
	color: #FFFFFF;
	font-size: 36px;
}
#Layer1 {
	position:absolute;
	width:479px;
	height:115px;
	z-index:1;
	left: 344px;
	top: 121px;
}
#Layer2 {
	position:absolute;
	width:200px;
	height:412px;
	z-index:1;
	left: 26px;
	top: 23px;
}
#Layer3 {
	position:absolute;
	width:218px;
	height:115px;
	z-index:2;
	left: 26px;
	top: 469px;
}
#Layer4 {
	position:absolute;
	width:231px;
	height:290px;
	z-index:3;
	left: 23px;
	top: 924px;
}
#Layer5 {
	position:absolute;
	width:200px;
	height:160px;
	z-index:1;
	left: 292px;
	top: 1282px;
}
#Layer6 {
	position:absolute;
	width:200px;
	height:51px;
	z-index:2;
	left: 1176px;
	top: 1283px;
}
#Layer7 {
	position:absolute;
	width:136px;
	height:29px;
	z-index:2;
	left: 692px;
	top: 1280px;
}
-->
</style>
</head>

<body>
<div id="Layer5"></div>
<div id="general">
<div id="titulo">
  <div align="center" class="Estilo1">MC DAVO </div>
  <div id="biografia"></div>
  <div id="texto""></div>
 
  
  <div id="Layer1">
    <p>David naci&oacute; el 30 de junio de 1991, en Nuevo Le&oacute;n. Cit&oacute; que estuvo en dicho lugar hasta que termin&oacute; el kinder en Tampico, Tamaulipas, para despu&eacute;s regresar y crecer en el municipio de Guadalupe, Nuevo Le&oacute;n.</p>
    <p>Trabajo como mesero en un Burger King antes de convertirse en rapero, en el 2012 deja su antiguo trabajo para dedicarse a la m&uacute;sica por completo.</p>
    <h2>Carrera musical</h2>
    <h3>2008-2009:&nbsp;<em>Haciendo lo imposible</em>&nbsp;y&nbsp;<em>Lo dejo a tu criterio</em></h3>
    <p>Sus inicios en el rap, se remontan a su alianza con m&aacute;s raperos como Ad&aacute;n Zapata y K&oacute;digo 36 de su ciudad natal como manera de apoyo para poder fijar su carrera. El principal soporte fue su amigo, Israel Flores, conocido con el sobrenombre de&nbsp;<em>Went,</em>&nbsp;que ten&iacute;a su propio&nbsp;<em>crew</em>&nbsp;de Hip-hop llamado&nbsp;<em>WOW Crew</em>. &#8203;</p>
    <h3>2011:&nbsp;<em>Psicosis</em>&nbsp;y&nbsp;<em>Psicosis ll</em></h3>
    <p>En 2011 K&oacute;digo 36 dej&oacute; de producir a MC Davo. Davo se al&iacute;a con Sargento Rap y MC Aese. David empieza a hacer colaboraciones con Doble D, e invita a Meny M&eacute;ndez a producir su tercer disco,&nbsp;<em>Psicosis</em>, en 2011. En ese mismo a&ntilde;o lanz&oacute; su primer video musical del sencillo &laquo;La descarga&raquo;, primer tema de&nbsp;<em>Psicosis</em>&nbsp;que fue lanzado el 1 de octubre de 2011. &#8203;</p>
    <h3>2014-2016:&nbsp;<em>El dominio</em></h3>
    <p>En marzo firma con Warner Music M&eacute;xico, &#8203; para distribuir su m&uacute;sica a un nivel m&aacute;s global e internacional, sacando su primer &aacute;lbum de estudio&nbsp;<em>El dominio</em>&nbsp;contando con 15 canciones. &#8203; En junio de 2014 sac&oacute; el videoclip del sencillo &laquo;Andamos de parranda&raquo;. En julio, sac&oacute; una colaboraci&oacute;n con Smoky, &laquo;La propuesta&raquo; que forma parte del disco&nbsp;<em>El dominio (deluxe)</em>. En agosto, realiz&oacute; colaboraciones con C-Kan en el disco&nbsp;<em>The Take Over</em>, del sello discogr&aacute;fico Mastered Trax. &#8203;</p>
    <p>En 2015, public&oacute; el videoclip de &laquo;Qu&iacute;mica&raquo; saliendo para finales de agosto. Tras su reciente disco,&nbsp;<em>El dominio,</em>&nbsp;dio lugar a una edici&oacute;n especial del mismo:&nbsp;<em>El dominio deluxe</em>, que sali&oacute; a la venta el 25 de septiembre de 2015, incluyendo una nueva canci&oacute;n con Smoky, videos musicales de sus canciones de&nbsp;<em>El dominio</em>&nbsp;y un documental para exponer los inicios de su carrera. &#8203;</p>
    <p>En octubre MC Davo, anunci&oacute; que colaborar&iacute;a en 4 canciones con C-Kan. Ese a&ntilde;o fue confirmado para el evento de Urbano Fest. &#8203;</p>
    <h3>2017-2019:&nbsp;<em>Las 2 caras</em></h3>
    <p>En agosto de ese lanz&oacute; su cuarto &aacute;lbum en pre-venta iTunes titulado&nbsp;<em>Las 2 caras</em>&nbsp;con 12 canciones y en f&iacute;sico ser&aacute; lanzado el 8 de septiembre con 14 canciones. &#8203; &#8203; En octubre de ese a&ntilde;o particip&oacute; en la ceremonia de los Eliot Award de la marca mexicana Kleenex, una de sus m&aacute;s importantes presentaciones en directo, en donde junto a C-Kan interpret&oacute; la canci&oacute;n &laquo;Round 4&raquo; con la que dieron luz verde a la ceremonia. &#8203;&#65279;</p>
    <h3>2020-presente:&nbsp;<em>Canciones mamalonas</em></h3>
    <p>El 16 de abril de 2020, participa en el sencillo ben&eacute;fico &laquo;Resistir&eacute; M&eacute;xico&raquo; junto a varios artistas. &#8203; El 26 de mayo de ese a&ntilde;o, lanz&oacute; su &aacute;lbum&nbsp;<em>Canciones mamalonas.</em>&nbsp;&#8203;</p>
  </div>
  <div id="carrusel">
    <div id="Layer2"><img src="../VIDEOS/tenor.gif" alt="l" width="220" height="412" /></div>
    <div id="Layer3"><img src="../VIDEOS/davo.gif" alt="&ntilde;" width="220" height="414" /></div>
    <div id="Layer4"><img src="../VIDEOS/tumblr_mognj9z55D1sw0yxwo1_400.gif" alt="x" width="226" height="285" /></div>
  </div> 
  
  <div id="Layer7">
    <a href="Index.html" >
  <button type="button" class="btn btn-danger Estilo7 Estilo9">
    <div align="left" class="Estilo10">
      <div align="center" class="Estilo2"><span class="Estilo3">Index</span>l</div>
    </div>
</button> </div>
  </div>
</div>

</div>


</body>
</html>
